In [ ]:
import numpy as np
import pandas as pd

In [ ]:
data = {
    'Name': ['Ali', 'Waseem', 'Sattar'],
    'Courses': ['Maths', 'Physics', 'Chemistry'],

    
}

In [ ]:
df = pd.DataFrame(data)
df

In [ ]:
df.shape

In [ ]:
import numpy as np
import pandas as pd

data = {
    'Students': [
        'Ali', 'Hassam', 'Kashif', 'Waseem', 'Sattar',
        'Noman', 'Hina', 'Ayesha', 'Bilal', 'Zain',
        'Hassan', 'Sara', 'Hamza', 'Iqra', 'Usman',
        'Fatima', 'Ahmed', 'Tariq', 'Maha', 'Raza'
    ],
    'Marks': np.random.randint(50, 100, 20),
    'Language': [
        'Python', 'JavaScript', 'TypeScript', 'C', 'C#',
        'Java', 'Go', 'Rust', 'Swift', 'Kotlin',
        'PHP', 'Ruby', 'Perl', 'Scala', 'Dart',
        'SQL', 'R', 'Julia', 'MATLAB', 'Elixir'
    ],
    'Age': np.random.randint(18, 30, 20),
    'Gender': [
        'Male', 'Male', 'Male', 'Male', 'Male',
        'Male', 'Female', 'Female', 'Male', 'Male',
        'Male', 'Female', 'Male', 'Female', 'Male',
        'Female', 'Male', 'Male', 'Female', 'Male'
    ],
    'City': [
        'Lahore', 'Karachi', 'Islamabad', 'Multan', 'Peshawar',
        'Quetta', 'Rawalpindi', 'Faisalabad', 'Sialkot', 'Hyderabad',
        'Gujranwala', 'Sargodha', 'Bahawalpur', 'Sukkur', 'Mardan',
        'Kasur', 'Okara', 'Dera Ghazi Khan', 'Chiniot', 'Swat'
    ],
    'Country': ['Pakistan'] * 20,
    'Passed': np.random.choice([True, False], 20),
    'Grade': np.random.choice(['A', 'B', 'C', 'D'], 20),
    'Attendance': np.random.randint(70, 100, 20),
    'Project_Score': np.random.randint(60, 100, 20),
    'Assignments': np.random.randint(5, 15, 20),
    'Quizzes': np.random.randint(3, 10, 20),
    'Semester': np.random.choice(['Spring', 'Fall'], 20),
    'GPA': np.round(np.random.uniform(2.0, 4.0, 20), 2),
    'Scholarship': np.random.choice([True, False], 20),
    'Phone': [f"+92-300-{np.random.randint(1000000, 9999999)}" for _ in range(20)],
    'Email': [f"student{i}@example.com" for i in range(1, 21)],
    'Join_Year': np.random.randint(2018, 2025, 20),
    'Graduated': np.random.choice([True, False], 20)
}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df.shape

In [ ]:
df.size

In [ ]:
df

In [ ]:
# rows ---> records
# columns ----> features

In [ ]:
df.head()

In [ ]:
df.tail()

In [ ]:
df.head(7)

In [22]:
df.columns

Index(['Students', 'Marks', 'Language', 'Age', 'Gender', 'City', 'Country',
       'Passed', 'Grade', 'Attendance', 'Project_Score', 'Assignments',
       'Quizzes', 'Semester', 'GPA', 'Scholarship', 'Phone', 'Email',
       'Join_Year', 'Graduated'],
      dtype='object')

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 20 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Students       20 non-null     object
 1   Marks          20 non-null     int32
 2   Language       20 non-null     object
 3   Age            20 non-null     int32
 4   Gender         20 non-null     object
 5   City           20 non-null     object
 6   Country        20 non-null     object
 7   Passed         20 non-null     bool
 8   Grade          20 non-null     object
 9   Attendance     20 non-null     int32
 10  Project_Score  20 non-null     int32
 11  Assignments    20 non-null     int32
 12  Quizzes        20 non-null     int32
 13  Semester       20 non-null     object
 14  GPA            20 non-null     float64
 15  Scholarship    20 non-null     bool
 16  Phone          20 non-null     object
 17  Email          20 non-null     object
 18  Join_Year      20 non-null     int32
 19  Graduated      20 non-null     bool
dtypes: bool(3), float64(1), int32(7), object(9)
memory usage: 2.3+ KB

In [ ]:
df.head()

In [ ]:
df.info()

In [ ]:
df.head()

In [24]:
df.describe()

,Marks,Age,Attendance,Project_Score,Assignments,Quizzes,GPA,Join_Year
count,20.000000,20.000000,20.000000,20.00000,20.000000,20.000000,20.00000,20.000000
mean,75.300000,24.550000,82.500000,82.90000,8.800000,6.600000,3.05900,2020.400000
std,12.711785,3.153528,8.923653,12.48536,2.948684,1.984148,0.55032,1.902906
min,53.000000,19.000000,70.000000,60.00000,5.000000,3.000000,2.10000,2018.000000
25%,67.000000,22.000000,75.750000,75.00000,6.000000,5.000000,2.69000,2018.000000
50%,78.500000,25.000000,79.500000,84.00000,8.500000,7.000000,3.14000,2020.500000
75%,85.500000,27.250000,90.250000,93.00000,11.250000,8.250000,3.40000,2022.000000
max,94.000000,29.000000,97.000000,99.00000,14.000000,9.000000,3.94000,2024.000000

In [ ]:
# Is there any data type in dataframe related to datetime or date?
# how to access any column of a dataframe?
# If yes, then how to change the datatype of any column into datetime or date?